def filter_by_state(list):
    """Функция которая принимает список словарей и опционально значение для ключа
state (по умолчанию 'EXECUTED').
 Функция возвращает новый список словарей, содержащий только те словари, у которых ключ
state соответствует указанному значению"""
    pass



def sort_by_date(date):
    """Функция которая принимает список словарей и необязательный параметр,
     задающий порядок сортировки (по умолчанию — убывание).
     Функция должна возвращать новый список, отсортированный по дате (date)."""
    pass
